In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
# CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
# ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
# INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
# CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
# NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
# RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
# AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
# DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
# RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
# TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
# PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
# B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
# LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
# MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [5]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [6]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [7]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [8]:
tasks+=1
pd.read_sql(
    '''
    select 'CRIM' col_name, sum(CRIM is null) nan from boston
    union all
    select 'ZN' col_name, sum(ZN is null) nan from boston
    union all
    select 'INDUS' col_name, sum(INDUS is null) nan from boston
    union all
    select 'CHAS' col_name, sum(CHAS is null) nan from boston
    union all
    select 'NOX' col_name, sum(NOX is null) nan from boston
    
    ''',
    con,
)

  col_name  nan
0     CRIM    0
1       ZN    0
2    INDUS    0
3     CHAS    0
4      NOX    0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [9]:
tasks+=1
pd.read_sql(
    '''
    select 'CRIM' col_name, count(distinct CRIM) cnt_unique from boston
    union all
    select 'ZN' col_name, count(distinct ZN) cnt_unique from boston
    union all
    select 'INDUS' col_name, count(distinct INDUS) cnt_unique from boston
    union all
    select 'CHAS' col_name, count(distinct CHAS) cnt_unique from boston
    union all
    select 'NOX' col_name, count(distinct NOX) cnt_unique from boston
    ''',
    con,
)

  col_name  cnt_unique
0     CRIM         504
1       ZN          26
2    INDUS          76
3     CHAS           2
4      NOX          81

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [10]:
tasks+=1
pd.read_sql(
    '''
    with 
    crim_c as
    (select 'CRIM' col_name, avg(crim_m) = min(CRIM) c from
    (select CRIM crim_m from boston order by CRIM
    limit 2 offset (select (count() - 1) / 2 from boston)), boston),
    zn_c as
    (select 'ZN' col_name, avg(zn_m) = min(ZN) c from
    (select ZN zn_m from boston order by ZN
    limit 2 offset (select (count() - 1) / 2 from boston)), boston),
    indus_c as
    (select 'INDUS' col_name, avg(indus_m) = min(INDUS) c from
    (select INDUS indus_m from boston order by INDUS
    limit 2 offset (select (count() - 1) / 2 from boston)), boston),
    chas_c as 
    (select 'CHAS' col_name, avg(chas_m) = min(CHAS) c from
    (select CHAS chas_m from boston order by CHAS
    limit 2 offset (select (count() - 1) / 2 from boston)), boston),
    nox_c as 
    (select 'NOX' col_name, avg(nox_m) = min(NOX) c from
    (select NOX nox_m from boston order by NOX
    limit 2 offset (select (count() - 1) / 2 from boston)), boston)
                   
    select col_name from (
    select * from crim_c
    union all
    select * from zn_c
    union all
    select * from indus_c
    union all
    select * from chas_c
    union all
    select * from nox_c
        
    )
    where c = 1
    ''',
    con,
)

  col_name
0       ZN
1     CHAS

In [11]:
# –í—ã–≤–æ–¥: –í –¥–∞–Ω–Ω—ã—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–¥–Ω–æ–≥–æ –∑–Ω–∞—á–µ–Ω–∏—è –ø–æ –≤—Å–µ–π –≤—ã–±–æ—Ä–∫–µ –ø—Ä–∏–æ–±–ª–∞–¥–∞–µ—Ç –Ω–∞–¥ –¥—Ä—É–≥–∏–º–∏,
# —Ç.–µ. –∑–Ω–∞—á–µ–Ω–∏—è –≤ –∫–æ–ª–æ–Ω–∫–∞—Ö –Ω–µ —Å–±–∞–ª–∞–Ω—Å–∏—Ä–æ–≤–∞–Ω—ã.

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [12]:
tasks+=1
pd.read_sql(
    '''
    with 
    h as 
    (select avg(RM) avg_high from boston
    group by medv
    order by medv desc
    limit 1),
    min_25 as 
    (select 25 n_h, avg(RM) rm_avg, avg_high rm_avg_h, avg_high-avg(RM) diff from
    (select RM, medv from boston
    order by medv
    limit 25), h),
    min_50 as 
    (select 50 n_h, avg(RM) rm_avg, avg_high rm_avg_h, avg_high-avg(RM) diff from
    (select RM, medv from boston
    order by medv
    limit 50), h),
    min_100 as 
    (select 100 n_h, avg(RM) rm_avg, avg_high rm_avg_h, avg_high-avg(RM) diff from
    (select RM, medv from boston
    order by medv
    limit 100), h),
    min_200 as 
    (select 200 n_h, avg(RM) rm_avg, avg_high rm_avg_h, avg_high-avg(RM) diff from
    (select RM, medv from boston
    order by medv
    limit 200), h),
    min_300 as
    (select 300 n_h, avg(RM) rm_avg, avg_high rm_avg_h, avg_high-avg(RM) diff from
    (select RM, medv from boston
    order by medv
    limit 300), h)
    
    select * from min_25
    union all
    select * from min_50
    union all
    select * from min_100
    union all
    select * from min_200
    union all
    select * from min_300
            
    ''',
    con,
)

   n_h    rm_avg  rm_avg_h      diff
0   25  5.747840     7.484  1.736160
1   50  5.753240     7.484  1.730760
2  100  5.887120     7.484  1.596880
3  200  5.911705     7.484  1.572295
4  300  5.972227     7.484  1.511773

In [13]:
# –í—ã–≤–æ–¥: –í–ª–∏—è–µ—Ç

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [14]:
tasks+=1
pd.read_sql(
    '''
    with r as
    (select LSTAT, MEDV,
    rank () over (order by LSTAT) lstat_r
    from boston)
    
    select LSTAT, MEDV, lstat_r
    from r
    where MEDV = (select max(MEDV) from boston)
    ''',
    con,
)

    LSTAT  MEDV  lstat_r
0    1.73  50.0        1
1    1.92  50.0        2
2    2.88  50.0        6
3    2.96  50.0        8
4    2.97  50.0        9
5    3.16  50.0       15
6    3.26  50.0       17
7    3.32  50.0       18
8    3.70  50.0       26
9    3.73  50.0       27
10   4.45  50.0       41
11   4.63  50.0       50
12   5.12  50.0       67
13   7.44  50.0      141
14   8.88  50.0      181
15   9.53  50.0      203

In [15]:
# –í—ã–≤–æ–¥: –í —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö –¥–æ–º–∞—Ö –ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º –Ω–∏–∑–∫–∏–π

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [16]:
tasks+=1
pd.read_sql(
    '''
    with 
    h_r as
    (select MEDV, CHAS from boston
    where CHAS = 1),
    h_c AS 
    (select MEDV, CHAS from boston
    where CHAS = 0)
            
    select avg(MEDV) avg_price, CHAS from h_c
    union all
    select avg(MEDV) avg_price, CHAS from h_r
    ''',
    con,
)

   avg_price  CHAS
0  22.093843   0.0
1  28.440000   1.0

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [17]:
tasks+=1
pd.read_sql(
    '''
    select col_name from 
    (select 'CRIM'col_name, 
    (select avg(CRIM) from boston where CHAS = 1) > avg(CRIM) c
    from boston
    union all
    select 'ZN' col_name, 
    (select avg(ZN) from boston where CHAS = 1) > avg(ZN) c
    from boston
    union all
    select 'INDUS' col_name,
    (select avg(INDUS) from boston where CHAS = 1) > avg(INDUS) c
    from boston
    union all
    select 'NOX' col_name,
    (select avg(NOX) from boston where CHAS = 1) > avg(NOX) c
    from boston
    union all
    select 'RM' col_name,
    (select avg(RM) from boston where CHAS = 1) > avg(RM) c
    from boston
    union all
    select 'AGE' col_name,
    (select avg(AGE) from boston where CHAS = 1) > avg(AGE) c
    from boston
    union all
    select 'DIS' col_name,
    (select avg(DIS) from boston where CHAS = 1) > avg(DIS) c
    from boston
    union all
    select 'RAD' col_name,
    (select avg(RAD) from boston where CHAS = 1) > avg(RAD) c
    from boston
    union all
    select 'TAX' col_name,
    (select avg(TAX) from boston where CHAS = 1) > avg(TAX) c
    from boston
    union all
    select 'PTRATIO' col_name,
    (select avg(PTRATIO) from boston where CHAS = 1) > avg(PTRATIO) c
    from boston
    union all
    select 'B' col_name,
    (select avg(B) from boston where CHAS = 1) > avg(B) c
    from boston
    union all
    select 'LSTAT' col_name,
    (select avg(LSTAT) from boston where CHAS = 1) > avg(LSTAT) c
    from boston
    union all
    select 'MEDV' col_name,
    (select avg(MEDV) from boston where CHAS = 1) > avg(MEDV) c
    from boston)
    where c = 1
    ''',
    con,
)

  col_name
0    INDUS
1      NOX
2       RM
3      AGE
4        B
5     MEDV

In [18]:
# –í—ã–≤–æ–¥: –í–æ–∑–ª–µ —Ä–µ–∫–∏ –±–æ–ª—å—à–µ –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω—ã—Ö –ø—Ä–µ–¥–ø—Ä–∏—è—Ç–∏–π –ø–æ—ç—Ç–æ–º—É –±–æ–ª—å—à–µ —Å–æ–¥–µ—Ä–∂–∞–Ω–∏–µ –¥–∏–æ–∫—Å–∏–¥–∞ –∞–∑–æ—Ç–∞ –≤ –≤–æ–∑–¥—É—Ö–µ.

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [19]:
tasks+=1
pd.read_sql(
    """
    select 100 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*10/10-1) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*10/10-1) nox
    union all
    select 90 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*9/10) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*9/10) nox
    union all
    select 80 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*8/10) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*8/10) nox
    union all
    select 70 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*7/10) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*7/10) nox
    union all
    select 60 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*6/10) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*6/10) nox
    union all
    select 50 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*5/10) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*5/10) nox
    union all
    select 40 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*4/10) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*4/10) nox
    union all
    select 30 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*3/10) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*3/10) nox
    union all
    select 20 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*2/10) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*2/10) nox
    union all
    select 10 perc, 
    (select INDUS from boston order by INDUS limit 1 offset (select count() from boston)*1/10) indus,
    (select NOX from boston order by NOX limit 1 offset (select count() from boston)*1/10) nox
    
    """,
    con,
)

   perc  indus    nox
0   100  27.74  0.871
1    90  19.58  0.713
2    80  18.10  0.668
3    70  18.10  0.605
4    60  12.83  0.575
5    50   9.69  0.538
6    40   7.38  0.507
7    30   5.96  0.472
8    20   4.39  0.442
9    10   2.89  0.426

In [20]:
# –í—ã–≤–æ–¥: –°–≤—è–∑—å –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è, –Ω–∞–±–ª—é–¥–∞–µ—Ç—Å—è –∫–æ—Ä—Ä–µ–ª—è—Ü–∏—è

In [21]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ